Revit 2024 API
WireMaterialTypeSet Properties
The WireMaterialTypeSet type exposes the following members.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
IsReadOnly
Identifies if the object is read-only or modifiable.
 (Inherited from APIObject.)
Size
Returns the number of wire material types that are in the set.
See Also
WireMaterialTypeSet Class
Autodesk.Revit.DB.Electrical Namespace